## DataFrame Manipulation

In [1]:
#Lets Import imp libraries
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [2]:
matrix_data=np.matrix('24,66,140;44,72,148;30,62,125;35,68,160;25,62,152')
row_labels=['Raju','Parul','Sunita','Sunil','Ashok']
column_headings=['Age','Height','Weight']

In [9]:
df=pd.DataFrame(data=matrix_data,index=row_labels,columns=column_headings)
print('\n A new DataFrame \n','-'*20,sep='')
print(df)

 A new DataFrame
--------------------
        Age  Height  Weight
Raju     24      66     140
Parul    44      72     148
Sunita   30      62     125
Sunil    35      68     160
Ashok    25      62     152

In [10]:
#How we can only print Height and Weight

In [11]:
only_ht_wt=df[['Height','Weight']]

In [12]:
only_ht_wt

        Height  Weight
Raju        66     140
Parul       72     148
Sunita      62     125
Sunil       68     160
Ashok       62     152

In [13]:
#Print Age by . method('Generally it would'nt Use)

In [14]:
print("\n 'Age' accessed by Dot Method (Not Recommended)\n",'-'*55,sep='')
print(df.Age)#You can Access only column at a time

 'Age' accessed by Dot Method (Not Recommended)
-------------------------------------------------------
Raju      24
Parul     44
Sunita    30
Sunil     35
Ashok     25
Name: Age, dtype: int32

In [ ]:
#Select particular index data using loc(index name) loc=Locate

In [15]:
df.loc['Sunita']

Age        30
Height     62
Weight    125
Name: Sunita, dtype: int32

In [16]:
#Select Particular index data using iloc(index position) iloc=index Locate

In [17]:
df.iloc[1]

Age        44
Height     72
Weight    148
Name: Parul, dtype: int32

In [19]:
print("/n select index and column for a particular data \n")
print(df.loc['Sunil','Height'])

/n select index and column for a particular data

68

In [20]:
#Select Index and list of column data\n

In [21]:
print("\n Select Index and list of column data\n")
print(df.loc['Ashok',['Height','Weight']])

 Select Index and list of column data

Height     62
Weight    152
Name: Ashok, dtype: int32

In [22]:
#Select list of index and column data

In [24]:
print("\n Select List of index and column data \n")
print(df.loc[['Parul','Sunil'],['Age','Weight']])

 Select List of index and column data

       Age  Weight
Parul   44     148
Sunil   35     160

In [25]:
#Check original df

In [26]:
df

        Age  Height  Weight
Raju     24      66     140
Parul    44      72     148
Sunita   30      62     125
Sunil    35      68     160
Ashok    25      62     152

## Select data on condition

In [27]:
#Check wheather height in greater then 65

In [29]:
print("\n Rows with Height >65 inch \n")
print(df[df['Height']>65])

 Rows with Height >65 inch

       Age  Height  Weight
Raju    24      66     140
Parul   44      72     148
Sunil   35      68     160

In [30]:
booldf1=df['Height']>65
booldf2=df['Weight']>145

In [ ]:
#Select Rows with Height >65 inch and Weight >145 lbs

In [31]:
print("\n Select With Height >65 inch and weight >145\n",'-'*68,sep='')
print(df[(booldf1)& (booldf2)])

 Select With Height >65 inch and weight >145
--------------------------------------------------------------------
       Age  Height  Weight
Parul   44      72     148
Sunil   35      68     160

In [32]:
#DataFrame with only Age and Weight Columns Whose Height>68 inch

In [33]:
print("\n DataFrame With only Age And Weight columns whose Height >68 inch \n",'-'*60,sep='')
print(df[booldf1][['Age','Weight']])

 DataFrame With only Age And Weight columns whose Height >68 inch
------------------------------------------------------------
       Age  Weight
Raju    24     140
Parul   44     148
Sunil   35     160

In [ ]:
#create new variable and assign the booldf1 and save in new variable

In [34]:
selected_candidates=df[booldf1][['Age','Weight']]
selected_candidates

       Age  Weight
Raju    24     140
Parul   44     148
Sunil   35     160

In [ ]:
#Lets Know About resetting Index

In [35]:
print("\n After resetting index \n",'-'*35)
print(df.reset_index())

 After resetting index
 -----------------------------------
    index  Age  Height  Weight
0    Raju   24      66     140
1   Parul   44      72     148
2  Sunita   30      62     125
3   Sunil   35      68     160
4   Ashok   25      62     152

In [36]:
#Lets Print whose age in <35

In [37]:
print("\n Rows with age <30 year\n",'-'*30,sep='')
df=df[df['Age']<30]
print(df)

 Rows with age <30 year
------------------------------
       Age  Height  Weight
Raju    24      66     140
Ashok   25      62     152

In [38]:
#After resetting index with drop

In [41]:
print("\n After Resetting index with 'drop' option True \n",'-'*30,sep='')
print(df.reset_index(drop=True))

 After Resetting index with 'drop' option True
------------------------------
   Age  Height  Weight
0   24      66     140
1   25      62     152

In [42]:
#Add new Column Profession

In [46]:
print("\n Adding a new column 'Profession' \n",'-'*45,sep=' ')
df['Profession']='Student Teacher'.split( )
print(df)

 Adding a new column 'Profession'
 ---------------------------------------------
       Age  Height  Weight Profession
Raju    24      66     140    Student
Ashok   25      62     152    Teacher

In [45]:
df

       Age  Height  Weight
Raju    24      66     140
Ashok   25      62     152

In [47]:
print("\n Setting 'Profession' column as index \n",'-'*45,sep='')
print(df.set_index('Profession'))

 Setting 'Profession' column as index
---------------------------------------------
            Age  Height  Weight
Profession
Student      24      66     140
Teacher      25      62     152